[
  {
    "title": "Upcoming articles in 2023",
    "link": "https://cesar.coatl.dev/2023/02/07/upcoming-articles-in-2023/",
    "pubDate": "Tue, 07 Feb 2023 14:13:00 -0800",
    "excerpt": "Hello, readers! These are some of the upcoming articles in this space. Taking a ten-year-old MacBook Air out for one last ride with Ubuntu - From macOS to Ubuntu, Pt. 1 (link) Installing pyenv and managing Python versions in Ubuntu - From macOS to Ubuntu, Pt. 2 (link) CI/CD -...",
    "tags": [],
    "author": "unknown-author",
    "source": "César Román - Coder, Blogger"
  },
  {
    "title": "Year in Review 2023",
    "link": "https://AnjuanSimmons.com/blog/year-in-review-2023/",
    "pubDate": "Wed, 27 Dec 2023 00:00:00 +0000",
    "excerpt": "Photo by Jake Weirick on Unsplash\n\n\nI turned 49 years old this year, and there were a lot of milestones over the last twelve months. It seemed like I had just started getting ready for 2023 a few months ago, and it’s already coming to an end. This posts captures the moments that stood out to me from January to December of this year. Since the most consistent journal of my life is my phone’s camera roll and social media, I’m sharing my favorite photos, my favorite social media post, and a summary of what stood out to me for each month. I end with my summary thoughts about 2023.\n\nNote: The image carousels in each Favorite Photos section will auto-rotate every few seconds, but you can manually navigate through each one using the < or > buttons on the left and right side of each one. If you’re reading this on a mobile device, you can also swipe left or right through the carousels.\n\n\n\nJanuary\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\n@aneika and I are happy to share that Koveil was accepted into @UTexasMcCombs! We’re incredibly proud of the hard work he put into this achievement. We both have undergraduate degrees from @UTAustin and we hope to guide his journey and also see him write his own Longhorn story! pic.twitter.com/Yj6bG6HNfx— Anjuan (@anjuan) January 31, 2023\n\n\nSummary\n\nMy wife and I love going to live events, and 2023 was a year filled with outings to plays and concerts. We saw New Jack City Live on Stage at the Hobby Center and Paradise Blue at the Ensemble Theater in January. Both were really well done with great casts and music.\n\nJanuary was also the month we learned that our oldest son, Koveil, had been accepted to the University of Texas at Austin. Not only that, he got into the prestgious McCombs School of Business! Aneika is a graduate of McCombs, and UT is the school where we first met each other many years ago. We were pleased that Koveil would start his own Longhorn Journey. Of course, he had to finish his senior year of high school first!\n\nWe also experienced basketball games, our daughter’s dance team events, and great times with cousins and other members of our extended family. January was a great start to our year!\n\n\n\n\nFebruary\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nOn this day 18 years ago, ⁦@aneika⁩ and I had our first child. We are so proud of the person he has become! He is a loving son, excellent role-model as a big brother, and steadfast friend. It’s been our honor to give him 18 years of love, and we look forward to his future! pic.twitter.com/7azNOotk9X— Anjuan (@anjuan) February 11, 2023\n\n\nSummary\n\nFebruary is when dance season heats up for our daughter Vicia, who, at the time, was a freshman on the Klein Oak Strutters dance team. While being on a back-to-back-to-back national champion level dance team has been challenging, Vicia has really thrived as a Strutter. She has become really strong a time management, and became a key contributor to the team. We spent quite a bit of time in February driving to her dance competitions, and we were really impressed by the immense talent of the Strutters! On top of all of that, Vicia was inducted into the Hispanic Honor Society, which Kyric, our youngest son, had also been inducted into the year before.\n\nKoveil went to a mixer for students who were offerred admission to UT, and he learned from current students about the univesity experience. We also took his senior photos at Post in downtown Houston. Koveil turned 18 in February, and it was hard to believe that our little baby boy was now a legal adult!\n\nFebruary was also the month that we celebrated the birthday of my wife’s best friend, Nina.\n\n\n\n\nMarch\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nToday marks the 21 years that have passed since ⁦@aneika⁩ and I married each other back in 2002. We’ve had amazing adventures and created three incredible humans. I am incredibly grateful for her! pic.twitter.com/zWikAHNyaC— Anjuan (@anjuan) March 9, 2023\n\n\nSummary\n\nMarch was a whirlwind of activity! Aneika and I went to the Houston Livestock Show and Rodeo along with Nina and enjoyed the performances. We knew March would have the last Spring Break with Koveil before he went to university, so we wanted to make it a memorable one. We considered a trip outside of the country, but we decided to rent the Poppy Lake Travis in Lago Vista and spend some time as a family in the Hill Country of Texas. We went bouldering in Pedernales Falls State Park, explored the underground world at Inner Space Caverns, and ate at some of our favorite Austin area restaurants like Salt Traders Coastal Cooking. We also celebrated our 21st wedding anniversary and Aneika’s birthday at Swift’s Attic.\n\nKyric earned his letter jacket and continued his extremely strong academic performance as a high school junior.\n\nVicia had a dance competition in Ft. Worth, and we drove with her to the event. In between dances, Aneika and I checked out the Amon Carter Museum of American Art which had a sobering exhibit called Emancipation: The Unfinished Project of Liberation.\n\nWe also took family photos in March where Nina also joined us.\n\n\n\n\nApril\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\n.@aneika did a great job presenting on burnout at @accenture’s International Women’s Day Celebration on Friday! pic.twitter.com/kHlu5TaEve— Anjuan (@anjuan) April 23, 2023\n\n\nSummary\n\nAneika and I really enjoyed the New Edition Legacy Tour on April 1st. It was fun enjoying the music and songs that defined our youth. Later that month, we went to a Rockets game which is a rare treat for us.\n\nKyric was inducted into the National Honor Society, and Vicia had Strutter duties. Koveil continue to enjoy the last few weeks of high school for him.\n\nI went with Aneika to Austin where she gave a great talk on burnout at the Accenture office for their International Women’s Day Celebration.\n\nI flew to Atlanta to give a talk at RailsConf. I had a chance to meet a number of my fellow Github employees which I always enjoy.\n\n\n\n\nMay\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nFirst Prom Night pic.twitter.com/n4tJPhpHWw— Anjuan (@anjuan) May 21, 2023\n\n\nSummary\n\nAneika and I saw 9 to 5: The Musical which was hilarious. I also went up to Wichita Falls to see my parents, and I was able to see my two brothers, too. My parents both have stages of dementia, and my Mom was doing better than my Dad. However, it was tough seeing both of them. I’m grateful I have three siblings as companions for navigating this stage of life.\n\nKoveil had his prom and high school graduation ceremony, and we hosted his graduation party at our home. We also went to a number of graduation parties thrown by his friends and fellow graduates.\n\nWe only had a couple of days to catch our breath before the start of a busy summer!\n\n\n\n\nJune\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nIt was a quick trip to Austin and then turning around and coming back to Houston, but we got our younger son set up in his dorm room for the McCombs Future Leaders Academy at the University of Texas at Austin! pic.twitter.com/TAXBr1I4PE— Anjuan (@anjuan) June 5, 2023\n\n\nSummary\n\nAneika is a huge Janet Jackson fan so we definitely had seats for her Together Again tour at the The Cynthia Woods Mitchell Pavilion. It was such an amazing show!\n\nAneika and I took Kyric to Austin for his participation in the week long McCombs Future Executive Academy which is a summer program for high school students who are considering going to UT. Koveil took part in the same program last year, and he had a great experience. Students stay in a dorm for the week long program and get an exposure to the concepts they would learn as business students at McCombs.\n\nShe and I then went to Chicago where Aneika had a conference at the Big 10 Conference Center. We took time to enjoy an architecture cruise, check out the Bean, watch Cabaret Zazoo, stop by Michelle Obama’s childhood home, and see a production of West Side Story. We enjoyed some of our favorite Chicago restaurants like Girl & the Goat, The Purple Pig, River Roast, and The Dearborn.\n\nWe returned home to repack and then fly with our kids to Washington, DC where Aneika had another conference. We had all been to DC before, but we did a few things we had not done before like take the official tour of the State Capitol. We took the Acela 2158 train from Union Station in DC to Moynihan Train Hall at Penn Station. We decided to take the train instead of fly because our kids had never before experienced a train ride. We saw the usual sights in New York City and also saw MJ the Musical which was absolutely fantastic. My sister came up from Philadelphia to spend time with us. We also got tickets to be in the audience for a taping of The View.\n\nKoveil went to Atlanta during the last week of June for an Inroads College Links conference in Atlanta.\n\n\n\n\nJuly\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nI flew to Manchester in the United Kingdom last week to give my talk on burnout at #MCRDevCon. It was a delightful event, and I loved meeting new people including a few old friends! Thanks to Chan Singh for capturing these awesome shots! pic.twitter.com/1bA4qSPmNZ— Anjuan (@anjuan) July 21, 2023\n\n\nSummary\n\nJuly wasn’t as busy as June, but we did a lot. Aneika and I saw the Black Girl Therapy play which was excellent. We also took the kids and some of their cousins to Lake Conroe where we spent a few hours in a pontoon and enjoyed the water.\n\nWe celebrated Kyric’s 17th birthday at Truluck’s.\n\nAneika and I did a candle making workshop at Love and Make with Nina and one of her friends.\n\nWe took Koveil to Austin for Freshman Orientation, and we went back to Austin later in July so he could take part in Camp Texas.\n\nI went to Manchester in the UK to give a talk at Manchester DevCon.\n\n\n\n\nAugust\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nI’ve only been in Copenhagen for a few hours (got delayed in London), but I’ve already had some awesome experiences. I chatted with my amazing fellow Hubber @TheAprilEdwards after her talk at #cphdevfest and stopped by the statue of famous Danish author Hans Christian Andersen! pic.twitter.com/euFB2WUBt1— Anjuan (@anjuan) August 29, 2023\n\n\nSummary\n\nAneika and I went to Boston where the Academy of Management conferece was held this year. We also took part in PhD Project events. Aneika and I , as usual, took some time to tour around Boston. We saw the slightly bizzare embrace statue of Dr. Martin Luther King, Jr and his wife Coretta. We also checked out the MIT Museum where there was an AI exhibit.\n\nA big part of August was taking Koveil to Austin and move him into Jester West Hall for the start of his first semester at UT.\n\nI flew to Denmark to give a talk at the Copenhagen Developers Festival.\n\n\n\n\nSeptember\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nLast night’s Homecoming pic.twitter.com/PLBKLhXe7B— Anjuan (@anjuan) September 24, 2023\n\n\nSummary\n\nAneika and I went to he newly opened Museum of Illusions. It was fun clowning around each installation in the faclity. Afterwards, we found a new favorite restaurant called Xin Chao which had amazing food.\n\nKoveil came home for a quick visit using the Megabus which is a direct bus from Austin to Houston.\n\nVicia and Kyric had their first days of sophomore and senior years, respectively.\n\nI introduced the family to EveryPlate which is a meal delivery service that provides recipes and the ingredients needed to make them. It was meant to be healtheir than eating out at restaurants but less of the effort required to plan and make meals from scratch.\n\nVicia received her driver’s permit which opened the path to her eventually getting her driver’s license like her brothers.\n\n\n\n\nOctober\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nI was delighted to meet @mipsytipsy at #ndcporto! Charity is one of the brightest minds in software development, and I regularly direct engineers of all experience levels to follow her on Twitter and read https://t.co/83k0ixbjTG. Charity also has the best stickers! pic.twitter.com/mSkhyK8Yip— Anjuan (@anjuan) October 18, 2023\n\n\nSummary\n\nFor the second year in a row, Vicia and I did “Guys and Gals” for Strutters. This is where members of the team do a sequence of dances with the men in their life. This year’s theme was “Disco”, and I had a great time dressing up and doing the dances with Vicia!\n\nSoon after “Guys and Gals”, the Strutters were off to New York City. I went to be a bit of an insurance policy since this was the first time Vicia was that far away without us. However, everything went well, and the girls had a great time! I think Vicia’s experience with us in New York earlier in the year made it easier for her to be in the city with her dance team. Also, my sister kindly came to one of the events to spend time with Vicia and myself.\n\nI took the train from New York City to New Haven to check on my Dad who we recently moved there from Wichita Falls. His physical health had declined from when I saw him in May, and his dementia seemed to be even worse. However, it was really good to see him with my own eyes.\n\nSoon after I returned to Houston, Aneika and I went to the Majic Under the Stars performances at the The Cynthia Woods Mitchell Pavilion. We listened to songs by Tanya Nolan, Mary Mary, Tamia, Tamar Braxton, and Tyrese. The hosts were Letoya Luckett and Arnez J.\n\nLater in October we saw an amazing performance called Step Afrika! Drumfolk at the Cullen Theater.\n\nAneika, Kyric, Vicia, and I saw the Negro Motorist Green Book exhibit at the Holocaust Museum Houston. I’ve known about the Green Book for many years, and it was awesome to see so much information being provided about such an innovative part of American history.\n\nI flew to Portugal at the end of Ocotber to speak at NDC Porto.\n\n\n\n\nNovember\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nI’m super excited to be a co-host for #GitHubUniverse along with ⁦@damovisa⁩ and ⁦@film_girl⁩! We’re dialing things in, and we have a fantastic experience for all of you tomorrow in the Host Studio at the YBCA! pic.twitter.com/cJpfWcj9qC— Anjuan (@anjuan) November 7, 2023\n\n\nSummary\n\nOne of the biggest work events I did this year was co-hosting GitHub Universe with Christina Warren and Damian Brady who also work at GitHub. I had a blast during the entire two day event!\n\nWhile I was in San Francisco at GitHub Universe, Aneika and her Mom went to Arkansas where she gave a talk on Wellness.\n\nAneika and I saw Canceled at the Houston Museum of Natural Science Burke Baker where multimedia artist Paul D. Miller (aka DJ Spooky) gave an immserve show about “banned” and “forbidden” theories across the ages.\n\nWe went to the African American Library at the Gregory School which had numerous exhibits about the hidden history of Houston.\n\nAs per our traidtion, I went with Koveil, Kyric, and Vicia to participate in Operation Turkey which is a program that delivers food to needy people. We later spent Thaknsgiving at Aneika’s parent’s house along with her siblings and their families.\n\n\n\n\nDecember\n\nFavorite Photos\n\n\n\n\n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n  \n\n\n\nFavorite Social Media Post\n\nToday marks my 49th birthday. I am incredibly grateful for the amazing life I've been lucky to live. My wife and three children are healthy and thriving, and we've had some incredible adventures together. pic.twitter.com/BWEr2xQDQx— Anjuan (@anjuan) December 4, 2023\n\n\nSummary\n\nAneika and I returned to Austin again for her to give a talk at the Texas Association of State Systems for Computing and Communications (TASSCC) State of the State conference. We also took some time to visit with Koveil and ate at a new restaurant in Austin called Uchiba.\n\nWe drove back from Austin and immediately went to see Janet Jackson again at the World AIDS day event. Once again, Miss Jackson did not disappoint.\n\nMy birthday is on December 4th and Vicia’s birthday is on December 7th, and both of our birthdays fell during the week this year. So, we had a celebration of both our birthdays with friends and family members on December 2nd.\n\nMy actual birthday was very cool. Aneika took me to Marcoza Trattoria for lunch and then Vicia and Kyric joined us for dinner that night at Truluck’s. These are two of my favorite restaurants because of the great food and the bottles of Casamigos Reposado tequila they have for margaritas!\n\nVicia spent her birthday with her friends at a dinner at Grimaldi’s.\n\nAneika was asked to give the address at the Sam Houston State University’s Black Excellence commencement ceremony for graduates of color, and she did an excellent job!\n\nWe have a tradition where we look at holiday lights with the McNeese family and their children, and we did that again next year. We found this neighborhood culdesac with an amazing toy train installation.\n\nWe went to see Anita Baker in concert, and we enjoyed seeing a lot of friends we knew at the venue.\n\nWe went to the Inroads College Links mixer at the historic Buffalo Soldiers National Museum.\n\nI took Vicia driving so that she can log the time she needs to eventually get her license. She is already a really good driver! Vicia and her friends regularly drive golf carts around the neighborhood, and I think that has provided her with a good set of basic instincts for driivng.\n\nWe have a variety of Christmas traditions and festivities which were lovely ways to close out the year.\n\n\n\n\n2023: The Year of Swift Transition\n\nThere’s a old hymn that says, “Time is filled with swift transition”. I would say 2023 was the year of “Swift Transition”. My older son transitioned from high school to college, my younger son is preparing to do the same, my daughter (and youngest child) turned 16, and I turned 49 which is one year short of being half a century old. There were a lot of transitions in 2023, and a few augured still more transitions to come.\n\nSo many events went from the idea stage to being several scrolls back in the Photos app on my phone. I’ve heard that time seems to speed up as you age, and I’m finding that to be true.\n\nThe dementia that is afflicting both of my parents has made me even more aware of the increasing tick tock of life’s clock. While I hope they have many more years to live, it’s unlikely that they will be unaware of a lot that’s going on around them. While I try to make healthy choices now that will hopefull prevent or blunt the effects of dementia on my own mind, I’m more aware than ever that we can lose our lives well before we physically die.\n\nI’m learning that the best response I can find to swift transition is slowing down. I’m taking the time to enjoy the present moment instead of rushing on to the next thing in my stacked schedule. I try to take time to enjoy each meal I consume and actually taste the food I’m eating. I’m finding the preciousness in each conversation no matter how banal or boring because all communication presents the gift of spending time with another human being who will also one day die.\n\nHere’s to a slow and intentional 2024.\n\nThe image carousels for this post were created using https://www.publicalbum.org/blog/embed-photos-slideshow-carousel-widget",
    "tags": [
      "year-in-review"
    ],
    "author": "unknown-author",
    "source": "Anjuan Simmons"
  },
  {
    "title": "Playing a CTF at Work",
    "link": "https://johnnyreina.com/ctf/2024/05/26/playing-ctf-at-work.html",
    "pubDate": "Sun, 26 May 2024 05:00:00 +0000",
    "excerpt": "Preface",
    "tags": [],
    "author": "unknown-author",
    "source": "Johnny Reina on Github Pages"
  },
  {
    "title": "I cannot be held responsible",
    "link": "https://mirth.cc/blog/cannot-be-held/",
    "pubDate": "Fri, 12 Jan 2024 01:36:00 +0000",
    "excerpt": "What does it mean to \"blog\"?",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "Deciphering the UIUC courses API",
    "link": "https://mirth.cc/blog/deciphering-uiuc/",
    "pubDate": "Sun, 16 Apr 2023 20:27:00 +0000",
    "excerpt": "Funnily enough, the university with the 5th best CS program has a wonky course API.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "Content Creator Not Found",
    "link": "https://mirth.cc/blog/deplatforming/",
    "pubDate": "Thu, 14 Dec 2023 19:53:00 +0000",
    "excerpt": "Deplatforming and why you're wrong about it.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "How do you make a button?",
    "link": "https://mirth.cc/blog/make-a-button/",
    "pubDate": "Sat, 19 Aug 2023 00:00:00 +0000",
    "excerpt": "Programming explained with teddy bears.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "Easier Said Than Done",
    "link": "https://mirth.cc/blog/meditation/",
    "pubDate": "Wed, 21 Jun 2023 00:00:00 +0000",
    "excerpt": "Meditation, a beautiful madness. Narrative, experience, and feeling.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "One day, you'll die",
    "link": "https://mirth.cc/blog/one-day/",
    "pubDate": "Thu, 02 Nov 2023 19:53:00 +0000",
    "excerpt": "Aging, youth, and why babies own the big screen.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  },
  {
    "title": "Over the shoulder",
    "link": "https://mirth.cc/blog/over-the-shoulder/",
    "pubDate": "Thu, 09 Nov 2023 13:32:00 +0000",
    "excerpt": "How to walk with your eyes to diffuse the awkward.",
    "tags": [],
    "author": "unknown-author",
    "source": "MIRTH.CC"
  }
]