[
  {
    "title": "我居然用回有线耳机了",
    "link": "https://tw93.fun/2024-05-08/sony.html",
    "pubDate": "Wed, 08 May 2024 00:00:00 -0400",
    "excerpt": "关于我用回有线耳机这个事情\n\n男人的快乐，我居然用回有线耳机了，最近周末抽时间去线下试了不少好耳机，最后很意外买了索尼这款 MV1 开放式监听耳机，也不降噪还有线，却出奇的喜欢，想和大伙聊聊我的选择过程。\n\n现场去对比过 AirPods Max 音质很好很方便但是太太重了，不经常戴考虑颜值音质以及苹果互通其实很合适。\n\n索尼无线 WH-1000XM5 和 4，降噪很好也还轻，不太关心音质同时需要降噪耳机的很推荐 5，戴着也舒服，很适合出行使用。\n\n也去试了下 Bose QC45 和 700，前者比后者舒服，很舒服，而且样子也好看，700 也很有个性，不过音质有点儿闷，那个提示音很反人类有气无力那种感觉，但是戴着真的舒服，考虑舒适度喜欢低音的其实可以考虑。\n\n我很考虑音质我甚至去试了下 森海塞尔 HD 600、650、660S，都是有线，需要有前端去推，音质上假如习惯听交响乐那 600 是真的厉害，30 年的产品依然很抗打，喜欢听人声 650 超级合适，我觉得这一款对我而言是音质好性价比最高的，660 属于这两款有点结合，更贵钱够可考虑，但是普通设备推不动这种 300 和 150 欧阻抗的机子，需要配置一个很重的外放前端，只适合放家里书房使用，考虑到便携和钱最终还是放弃了，此外佩戴舒适度其实可以接受但是比不过前面索尼和 Bose 这两个。\n\n后面在索尼店里的时候，问店员有没有音质好的耳机可以试听，给我指了下里面有一个小屋都是有线好设备，进去听了听音质真的牛逼耳朵怀孕那种感觉，一看价格 2w 加上 1w 的外放给放弃了，只能欣赏买不起。\n\n在出来时候发现外面一个不起眼的台子上放着这台很不起眼的黑色塑料壳子的耳机索尼 MV1，拿起来顺手戴戴，我去！怎么这么轻怎么戴着这么舒服，怎么音质这么好，很突破我的固有想法，监听耳机不是专业人员用的吗，居然也这么适合听音乐，空旷音质很无敌，媲美上面听到的森海塞尔 HD660S。\n\n于是乎就决定就买这个稀有品种，网上买便宜点儿，最近收到了，一回到家就细细品味，O-Daiko 的鼓声，One I Love 的女声轻唱，Bubbles 的环境氛围音，Michael 的 Billie Jean 感觉就在耳边给你唱，很神奇属于我买的很喜欢的一个耳机。\n\n最后说起选择耳机，假如你是苹果机器，不考虑音质，其实 AirPods 系列很适合很方便，降噪就 Pro，颜值居家有钱头可以顶块砖就 Max。假如有考虑音质，也需要降噪那就推荐索尼 XM5 性价比就 4。假如考虑舒适降噪可以去现场试试 Bose，居家以及对于音质有极致要求，可以去试试森海。\n\n假如和我一样，有一个通行日常所需的小降噪苹果耳机，想随便听听考虑音质轻巧舒适度以及不介意有线，那可以试试这一款，但是由于每一个人耳朵不一样，还是很推荐去线下试听，无需跟风，最后还是要听自己的耳朵。\n\n索尼 MV1 的一些图片\n\n\n    \n        \n          \n        \n        \n            \n        \n    \n    \n        \n          \n        \n        \n            \n        \n    \n\n\n一些试耳机的好音乐\n\n\n  https://music.apple.com/cn/playlist/%E8%AF%95%E8%AF%95%E8%80%B3%E6%9C%BA/pl.u-V9D7mPEUB1GbxBk\n\n\n\n\n挑选了一些试耳机的音乐，范围比较广，有鼓声、人声、交响、环境氛围音等，给我感觉有一种有线耳机居然可以这么好听。我在音乐欣赏这一块属于很小白，欢迎大伙推荐，此外建议使用 Apple Music 来听无损，同时关闭音量平衡，无损的格式开到最大。\n\n值得一听的华语专辑\n\n\n  https://music.apple.com/cn/playlist/%E5%8D%81%E5%A4%A7%E4%B8%93%E8%BE%91/pl.u-mJy81mECzBL49zM\n\n\n\n\n很多好听的歌都是在我出生前后的年代，甚至更早很多年，太怀念那个时代了，还有有歌声留下来。\n\n\n  \n    \n      专辑名称\n      歌手\n      时间\n      经典歌曲\n    \n  \n  \n    \n      之乎者也\n      罗大佑\n      1982 年\n      鹿港小镇、之乎者也\n    \n    \n      唐朝\n      唐朝乐队\n      1992 年\n      梦回唐朝、飞翔鸟\n    \n    \n      新长征路上的摇滚\n      崔健\n      1989 年\n      新长征路上的摇滚\n    \n    \n      黑梦\n      窦唯\n      1994 年\n      高级动物\n    \n    \n      万能青年旅店\n      万能青年旅店\n      2010 年\n      杀死那个石家庄人\n    \n    \n      生命中的精靈\n      李宗盛\n      1994 年\n      爱的代价\n    \n    \n      范特西\n      周杰伦\n      2001 年\n      简单爱、爱在西元前\n    \n    \n      大熱\n      张国荣\n      1995 年\n      当年情、追\n    \n    \n      U 87\n      陈奕迅\n      2005 年\n      夕阳无限好\n    \n    \n      黑色柳丁\n      陶喆\n      1997 年\n      黑色柳丁\n    \n    \n      我去 2000 年\n      朴树\n      1999 年\n      那些花儿\n    \n    \n      吻別\n      张学友\n      1993 年\n      吻别\n    \n    \n      摇滚中国乐势力\n      魔岩三杰\n      1995 年\n      很多好听的歌\n    \n  \n\n\n结尾\n\n生活除了吃饱喝足，还需要有一点精神快乐，这样才会更有意思些。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "埃隆·马斯克传 - 读书笔记",
    "link": "https://tw93.fun/2024-04-14/musk.html",
    "pubDate": "Sun, 14 Apr 2024 00:00:00 -0400",
    "excerpt": "最近利用早上的阅读时间陆陆续续把《埃隆·马斯克传》给看完了，很推荐工程师同学一读，虽然平时马斯克在 X 上表现有些奇怪，其实在书里其实是一个实打实的工程师，很擅长将技术和商业以及成本控制结合的一个牛人，不过也有不少缺点的一个人，随手记录一些文字用于备忘。同样看完这本书，作为特斯拉股东，愿意继续持有。\n\n五部工作法\n\n\n  质疑每项要求，提出任何一项要求时，都应该附上提出这一要求的人。永远不要接受一项来自某个部门的要求，比如来自“法务部门”或者“安全部门”的要求。你必须知道提出这项要求的人的名字，接下来你应该质疑它，不管这个人有多聪明，聪明人提出的要求才是最危险的，因为人们不太可能质疑他们。这件事要一直做下去，即便这项要求来自我马斯克本人，质疑后，大家就要改进要求，让它变得不那么愚蠢。\n  删除要求当中所有你能删除的部分和流程，虽然你可能还得把它们加回来。事实上，你如果最后加回来的部分还不到删除部分的 10%，那就说明你删减得还不够。\n  简化和优化，这应该放在第 2 步之后，因为人们常犯的错误就是简化和优化一个原本不应该存在的部分或者流程。\n  加快周转时间，每个流程都可以加快，但只有遵循了前三个步骤之后才能这么做，在特斯拉工厂，我错误地把很多精力花在加快生产流程上，后来我才意识到有些流程原本就应该被拿掉。\n  自动化，在内华达工厂和弗里蒙特工厂犯下的一个大错就是我一开始试图将每个步骤进行自动化改造，我们本应该先质疑所有要求，删除不必要的部分和流程，把问题筛出来、处理掉，然后再推进自动化。\n\n\n这套工作法有时还衍生出一些推论\n\n\n  所有技术经理都必须有实战经验，比如说软件团队的管理人员必须至少花 20%的时间进行编程，太阳能屋顶业务的经理必须花时间在屋顶上亲自做安装工作。否则光说不练，他们就像是不会骑马的骑兵队队长、不会舞刀弄枪的将军。\n  “你好，我好，大家好”是很危险的，人们会因此不再质疑同事的工作成果。人们天然有一种倾向是不想把要好的同事踢下船，而这种危险倾向一定要避免。\n  犯错没关系，但错了还不肯低头就不行。\n  永远不要要求你的团队做你自己都不愿意做的事。\n  每当有问题需要解决时，不要只与你直接管理的相关负责人聊，深入调研就要跨层级沟通，去跟你属下的属下直接交流吧。\n  招聘要招态度端正的人，技能是可以教的，但要扭转一个人的工作态度可就太费劲了，得给他“换个脑子”，疯狂的紧迫感是我们公司运作的法则。\n  唯一要遵守的规则就是物理学定律能推导出来的规则，其他一切都只是建议。\n\n\n成本意识很强\n\n\n  几十年来，成本加成合同让航空航天业对成本控制问题漠不关心。火箭上的一个阀门比汽车上用的类似阀门要贵 30 倍，所以马斯克不断要求他的团队多从航空航天领域以外的公司采购零部件。Nasa 在空间站中使用的门闩，一个就要 1 500 美元。SpaceX 的一名工程师改造了浴室隔间门上使用的插销，做出了一种闭锁机构，成本只要 30 美元。一名工程师走到马斯克的办公室隔间，告诉他猎鹰 9 号有效载重舱的空气冷却系统要耗资 300 多万美元，他就扯着嗓子问旁边隔间的格温·肖特韦尔：家用的一套空调系统成本要多少钱？她回答说大约 6 000 美元。随后 SpaceX 团队就买了一些商用空调设备，改造了其中的泵，然后就把它用在了火箭顶部。\n  自从马斯克当年完成了俄罗斯之行，计算了一番自己制造火箭的成本后，他就在内部普及了一个概念，叫“白痴指数”，也就是一个零部件的总成本与它的原材料成本的比值。如果白痴指数很高，比如零部件成本 1000 美元，而制作它的铝的成本只有 100 美元，那么很可能就是设计过于复杂或制造过程效率太低导致的。\n  一天晚上，闪电击中了一个试验台，打坏了一个油箱的增压系统，导致油箱的一层膜出现鼓包和裂缝。换作一家正常的航空航天公司，那就应该更换油箱了，得花上几个月的时间。“不要换，修修就行。”马斯克说，“带着锤子上去，鼓包敲一敲，裂缝焊接好，然后接着弄。”布扎觉得这样做太疯狂了，但他已经学乖了，听老板的就好。于是他们走到试验合前，把隆起的鼓包敲回去。马斯克跳上飞机，飞了三个小时过来，亲自监督整个过程。“当他出现时，我们开始测试装有燃料的油箱，没有出什么问题。”布扎说，“埃隆相信逢山开路、遇水搭桥，出什么情况都有办法补救。这让我们获益匪浅，而且整个过程很有趣。”这样也为 SpaceX 省下了几个月的时间，可以测试火箭样机了。\n  我们应该要求这里面的每一个人看看他们能不能将自己负责的零部件成本降低 80%，”马斯克建议，“他们如果不能，而其他人可以做到，我们应该考虑让他们退位让贤。\n\n\n疯狂的管理风格\n\n\n  一般来说，在这种令人不安的成功时刻，马斯克会刻意制造出戏剧性事件。他会发起一场狂飙运动，立即投入行动，再宣布一个最后期限，通常这个期限不仅不切实际，而且毫无必要。自动驾驶日、星舰火箭堆叠太阳能屋顶安装、特斯拉量产地狱，每一次都是他拉响了警报，强迫大家开展“消防演习”。金博尔说：“通常情况下，他会走进他旗下的某家公司，搞点儿事情，把它变成一场危机。”但这次马斯克没有这样做，取而代之的是，他在没有经过深思熟虑的情况下决定收购推特。\n  然而推动变革没有那么多和风细雨。自猎鹰 1 号火箭以来，马斯克动用的手段一向如此：保持快速迭代，勇于承担风险，行事风格粗暴，接受阶段性失败，再次发起尝试。\n  从某些角度来说，马斯克就像史蒂夫·乔布斯，是一个能力出众但不近人情的“工头”，他们的现实扭曲力场可以把手底下的人逼疯，但也可以推动他们做出他们原以为不可能的事情。无论是对同事还是对竞争对手他们谁的面子都可以不给。但从 2011 年起执掌苹果公司的蒂姆·库克可不一样，他沉着冷静，高度自律，温文尔雅。虽然在必要的时候，他也很强硬，但他总是会避免那些不必要的冲突。乔布斯和马斯克似乎都很容易被戏剧性冲突吸引，而库克有一种化解戏剧性冲突的本能——他的道德罗盘是非常稳定的。\n  我算了一下，这样他就得管理六家公司——特斯拉、SpaceX 及其星链部门、推特、Boring Company、Neuralink 和 X.AI，这相当于史蒂夫·乔布斯巅峰时期掌舵公司（苹果和皮克斯）数量的 3 倍。\n  每当决定录用一个人或者提拔一个人时，马斯克都抱着这样一个观点：一个人的态度比他的简历他所掌握的技能更重要。他对“工作态度好”的定义就是一个人渴望疯狂工作、拼命工作。所以马斯克当场就雇用了邓契夫。\n  机器学习系统在进行自我训练时通常需要一个目标或指标作为指导。马斯克在管理时喜欢通过下命令的方式来决定哪些指标最重要，于是他给了他们一个标准：特斯拉全自动驾驶车辆在没有人类干预的情况下能够行驶的里程数。“我希望每次开会的第一张幻灯片都能展示每次干预前自动行驶里程的最新数据。”马斯克说，“如果训练人工智能，我们应该优化什么？答案是提高两次干预之间的行驶里程数。”他告诉他们。要向打游戏一样，每天都能看到自己的得分。“没有分数的电子游戏是无聊的，所以每天看着单次干预前的里程数增加就会很有干劲儿。”\n\n\n对待产品的态度\n\n\n  这是很典型的马斯克式做法，给新车绘制造型设计图纸的设计师应该与那些能决定车辆制造工艺的工程师携手合作。冯·霍兹豪森说：“在我工作过的其他公司里，有一些设计师的状态就是当甩手掌柜，他们有了设计思路，然后就把它发给工程师，对方可能在另一幢大楼里工作，甚至在另一个国家工作。”而马斯克会让工程师和设计师共处一室，冯·霍兹豪森说：“这样做希望达成的目标就是，我们要培养出一群像工程师一样思考的设计师，再培养出一群像设计师一样思考的工程师。”\n  马斯克有一个核心思想，就是不把工程和产品设计分开。事实上，产品设计应该由工程师来推动。像特斯拉和 SpaceX 一样，推特在所有组织层级上都应该以工程师为导向。\n  马斯克采取了一种迭代式的设计方法：迅速制成火箭和发动机原型，进行测试，炸毁，修改，再次尝试，知道最后做出能用的东西。快速推进，把试验品炸掉，然后重复这一过程。你不需要完美的规避多少问题，关键是你能多快找出问题，然后解决它。\n\n\n收购推特的故事\n\n\n  马斯克对工程问题的直觉很灵敏，但他的脑回路在处理人际情感问题时就不够灵光，而他收购推特的问题正在于此。他认为这是一家技术型公司，实际上它属于广告传媒行业，这个行业的逻辑是基于情感交流和人际关系的。\n  马斯克告诉他们，未来，推特的团队将由像他们这样的工程师来领导，而不是由设计师和产品经理。这是个微妙的转变，体现出他的价值观：推特的本质应该是一家软件工程公司，领导者一定是熟悉程序代码的人；它不是一家媒体和消费类产品公司，不应该让精通人际关系、洞察人心欲望的人来领导。\n  马斯克在恼羞成怒时，经常会抛出非常具体的问题来刁难别人。面对推特的高管，他就抛出了一连串的问题。他们的软件工程师平均每天写多少行代码？他在特斯拉的自动驾驶团队有 200 名软件工程师，为什么推特有 2500 名？推特每年在服务器上花费 10 亿美元，占用这些计算时间和存储空间最多的功能是什么？这些功能是如何排序的？他发现他们很难干脆地给出答案。在特斯拉，因为不了解这些细节，一些人丢掉了饭碗。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "我的极简生活经验",
    "link": "https://tw93.fun/2024-03-03/simple.html",
    "pubDate": "Sun, 03 Mar 2024 00:00:00 -0500",
    "excerpt": "极简是恰到好处的东西\n\n想和大伙随便聊聊的极简主义，我挺喜欢这种生活方式，但并不是说每个人需要极简，有的人喜欢收藏，有喜欢购物买很多东西，让自己舒心的生活方式我觉得都挺好的。但假如你也喜欢简单生活方式，或者有点儿强迫症，那这些小建议可能适合你。\n\n首先，极简主义不是把大部分的东西都扔掉，在空无一物的环境中才极简，而是选择对你重要的东西但不在于多，同时也没有必要每个地方都极简，比如说你喜欢读书以及某些收藏，完全是可以精挑细选去置办。极简生活更多是减少生活中不必要的元素，让你更多专注在真正重要的事物上。\n\n经常性的整理\n\n开始的第一步，应该是经常性的整理，一般是扔东西、卖二手、收纳起来，不要总觉得留着以后能用上，如果近 1 年都没用过，基本以后也用不上。\n\n扔东西：可以先从冰箱和厨房做起，对于过期的、好久没有动放了很久的东西给扔掉，这里很多人可以扔掉很多；接着收拾各种抽屉柜子里面比如已经坏掉的物件、没有用的配件、廉价充电线充电头、没用的说明书、之前放里面的票据、快递盒子、购物袋子等，总之一般是随手放里面，觉得以后会用的但是过了很久其实都没有用的东西。\n\n卖二手：接着你会发现有不少东西其实扔掉有些可惜，但是自己又不怎么用了，对于不太值钱但是又有些用的东西，比如再也不看的书、2 年都没有穿的旧衣服，可以去支付宝或者其他 App 看看有上门回收捐赠的服务，相比直接扔掉会让你觉得好一点；其次就是将还值点钱，但是消费冲动买的但是自己又不怎么用的东西，把它擦干净、拍照发闲鱼，卖给下一个冲动消费的人，这样可以帮你回一些本，这里其实也很好判断，比如说几乎半年都不用耳机、二手电脑、手表、小电器这一类很好出手，留下你一直在用而且很好用的那个就好，重复功能的东西只留一件。\n\n收纳起来：假如收纳空间有限，可以买几个收纳箱和真空收纳袋，这样你的存放物体的体积缩小一半，放到看不到的地方，比如不是这个季节的衣服、被子，都可以用收收纳袋抽干收起来，然后对于不太方便袋子装的可以用盒子装起来放柜子里，让它整齐和知晓位置，让每一个物品都有它特定的空间位置，用完返回原处下次找起来会很方便。\n\n上面整理的这一步，会花费你一些周末时间，不过当整理完成，打扫干净区域后，一般都会让你心情舒畅，感觉很爽的。\n\n培养自己的消费观\n\n接着第二步，慢慢培养自己的消费观，这里一般是 只买好的、不被消费主义、有目的的购买、不要囤东西 的这几个建议。\n\n只买好的：很多时候东西多的一个很大原因，就是买了很多自己觉得用得上的东西，或者是买的时候有些纠结，但是最后还是买了的那些东西，基本上放柜子里也不想用，还后悔。对于必须品而言，一般建议购买力所能及范围内更好的那一个，比如说手机、电脑、衣服、鞋子、耳机这一类，品质好，价格稍贵，但是会让你很长时间不会纠结要不要换一个更好的，同时也让你生活品质其实会更好，这里还可以新入了一件，可以尽快把之前那件按照第一步方法给整理掉。\n\n不被消费主义：越来越觉得，现在生活中大部分必须品都已经很满足了，很多时候消费都是属于仪式感下的消费，比如说看到小红书推荐、抖音里面好东西、得物上的潮流东西，会很容易被当时那个环境下误导下单，因为做电商的开发应该都知道，那一个个小功能其实都是一个大的产品业务团队同学天天想方设法迭代用来提高转化率用的，想方设法让你购买。\n\n有目的的购买：很容易出现在逛超市、逛山姆的时候，进去前就想着随便逛逛，结果你会发现出来后买了几百块东西，仔细一想，不少是属于可以买可不买的，其实可以在出发前，先想想这次要买的东西，列一个很简单清单，就不会剁手买一些自认为需要的东西，而且这种有目的的挑选方式会让你更舒服。这里同样适合去逛街的时候，先想好要买的东西和品牌。\n\n不要囤东西：囤东西本意是为了省钱和省心，当时很多时候买一箱箱的纸、洗衣液、沐浴露用一两年反而会让你烦心，甚至还会出现为了尽快用完，double 使用的方式，其实反而浪费了，还占用了你家里很多东西来放这些很多，很多时候，这些东西没有那么紧急，需要下单到到家其实很快的。这里还有一个东西也是容易囤的，那就是实体书了，这里可以先看电子书，再买纸质书，搬家的时候这东西很重的。\n\n减少网络中的被动消息\n\n上面从出和入两步控制住了你生活中的物件，其实还有一块是虚拟生活中的东西，其实也可以极简起来，这里说的是手机、电脑、知识这几块接收，信息的过载很多时候也让人过得不顺畅，尽量减少被动信息的接收，需要的信息主动寻找。\n\nApp 处理：我一般做法是 3 个月不用的 App 删除掉，用的时候再装用完又卸载或者直接小程序，这样手机 App 基本上控制在 2 屏完全可以满足生活所需；第二个是，控制所有 App 的消息，我一般只开启银行交易、支付宝交易、微信、工作软件的消息通知，其他的 App 的消息我都在设置里面去掉了，屏幕上没有小红点，同时很多 App 里面也可以设置去掉一些营销通知；第三个是，不装新闻软件、不装抖音快手，差不多一年多没有装了，感觉不太需要这种看着有用的新闻消息，这里对于电脑上的软件也是一样。\n\n资料整理：删除没有用的短消息，其实大部分都没有用，我平时一般是除了亲人信息，其他的定期全删除；然后第二个就是删除没有用的图片和视频，这里可以删除很多东西，第三个是删除没有用的微信聊天消息，之前不知道怎么加上的人也可以删除掉，让你常用的工具都是清爽的，这里对于电脑上的东西也是一样。\n\n主动接受消息：刚刚这些东西用于处理被动的消息接受，尽可能减少算法灌东西给你，更多的可以订阅 RSS 接收消息，关注喜欢的博主接收消息，不喜欢的直接屏蔽或者 mute 就好了，同时免打扰模式在你需要专注的时候可以开启起来，也即减少你不想看到的消息有很多你自己可以做的事情。\n\n差不多碎碎念完了，归根结底最重要的就是勤收拾、买好不买多、主动接收这几块，这种极简生活的方式很多时候可以影响一个人的三观，包括他做的产品、他的生活方式、他的喜好性格。最后同样也希望你快乐，过得幸福。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "2023年总结 - 随心而行",
    "link": "https://tw93.fun/2024-02-13/my-2023.html",
    "pubDate": "Tue, 13 Feb 2024 00:00:00 -0500",
    "excerpt": "今天是大年初四，哈哈我的年度总结又拖延了，22 年总结「率性而活」也是这个时候，23 年根据自己喜好做了不少想做的事情，小标题就叫「随心而行」吧，打算通过自问自答的方式来聊聊我这一年的生活、折腾、工作。\n\n生活\n\n一直觉得，假如日子每天过得都一样，那么这天就我被浪费掉了，所以我尽可能想着多去经历些不一样的事，多去见些不一样的人，这样的生活才有意思些。\n\n一. 23 年发生了哪些有意思的事？\n\n\n\n3 月，天气不错，去杭州周边踏春了下，看看新绿，还看了不少樱花，拍了下照片做潮流周刊的封面图，去了好多个不错的新咖啡店喝了喝咖啡，周末带着电脑去写代码。\n\n4 月，去千岛湖度了个假，记得一个鱼头 200 块还很难吃，商业气息有些重下次就不去了。月底还晚上去了趟西湖，体会了下 0 点年轻人的西湖，听到了万青的「杀死那个石家庄人」，很激情。\n\n5 月，做了个 全飞秒近视手术，把我 10 多年的眼镜给摘了，不戴眼镜很爽，这个月记忆深刻的就是天天滴眼药水以及视力恢复的这个过程很神奇。\n\n6 月，天气很热，不少时间周末在咖啡馆敲敲代码，剩余的时间都在逛家具和电器，看书桌、餐桌、电视柜、冰箱、洗衣机这些东西，选这种东西我特别感兴趣，因为有一种买自己喜欢东西的快乐感。\n\n7 月，月初去了一躺 深圳 GIAC 大会 分享「Pake-利用 Rust 轻松构建轻量级应用」，也是第一次去深圳，见到了好几年没见面的好哥们，后面还 去了香港，拍了不少照片，吃了不少东西，写了「香港和想象中不一样的地方」；下旬时候在掘金直播也分享了下 Rust 相关的内容；这个月我的 MacBook Pro M2 深空灰终于领到了，太太太喜欢了。\n\n8 月，月初线下和 Thomas Yao、图拉鼎、明城、安不菲等朋友良渚聚了聚，还去莫干山喝了咖啡，聊得很开心；中旬去了趟王小波书店「我的精神家园」，很安静很有感觉，我很爱王小波的文章；下旬最快乐的事情是买了大行 P8 折叠车，后面几个月都骑车上下班，吹着微风很舒服，现在居然累计骑行了 600 公里了，很爽。\n\n9 月，今年的一个大事，从出租屋搬到了新家，买了不少好看的家具和电器，弄了书房、猫屋，顺便搭建了个简单的家庭影院，慢慢有些过日子的感觉了，很满意。\n\n10 月，国庆又开玩具车回了趟湖南老家，吃了不少好吃的，回来后不久去了一趟重庆前端大会 分享「新一代前端的困境与破局」，也见到了好久没有见到的蚂蚁的朋友，吃了当地老火锅，玩了个周末很巴适。这个月买到了 15 Pro，顺手把 13 Pro 卖了，这个月还开始养鱼了，买了鱼缸/鱼/水草，喂食、换水、看鱼，挺有意思。\n\n11 月，疫情后的第一次出国，去了日本东京、大阪玩了 5 天，坐新干线见到了梦寐以求的富士山，上了晴空塔看东京夜景，去了东迪、银座，还和妙言的日文开发者甘吃了个饭聊得很开心，还给老婆买了个 GUCCI 的包，很好看，她很开心。\n\n12 月，去上海微软 GitHub Universe 分享「我的开源成长之旅」，见到了 Github 的 VP Scott Densmore，让我意识到能讲好英语在开源社区会更有趣，后面去看了浦东美术馆的展也挺不错；这个月买了 AirPods Pro2，弄了个烤肉架烤牛排味道还行，还买了个半自动咖啡机，每早一杯咖啡很舒服。\n\n12 月 1 月，上旬请了快 18 个小伙伴来家里玩了一天，玩 Switch、撸猫、打德州、吃烤肉，还不错；中旬 去了一趟安康，见到了一个很小的机场，吃到了好吃的蒸面，还从亲戚家顺回来几根麻辣香肠；快过年前给团队办了个年夜饭，包了个烤全羊的二楼，送了些礼物，有说有笑挺好的；这个月买了个好看的台灯、手感不错的麻将，补齐了做咖啡的器具，还去花鸟市场补了 10 条孔雀鱼，以及 5 年前 P2P 暴雷的团贷网居然开始退钱了，挺满足。\n\n24 年 2 月，年前 把家人从湖南接到了杭州过年玩了 10 天，在家做饭、打麻将、市内逛逛，春节一家子人热热闹闹的，很开心。\n\n二. 最值得纪念的事情是什么？\n\n一共有两个，第一个应该是 近视手术，从做决定要做完只花了 1 个月的样子，好在恢复得很正常，现在不戴眼镜很方便，过程可见 全飞秒近视手术过程和恢复记录。\n\n第二个是 搬到了新家，在 23 年的 9 月份底终于结束了租房的日子，四室一厅，弄了一个自己单独的书房，方便在里面安静的看书和写代码，入住过程中也 置办了不少自己想买的东西，这个挑选东西的过程也蛮有趣。\n\n\n    \n        \n          \n        \n        \n            \n        \n    \n\n\n折腾\n\n折腾对我而言更像是活着的兴奋剂，既是自己喜欢的事情，做好了又可以很好的帮助到更好的生活、学习和工作，甚至还可以让自己保持年轻，这种正反馈的感觉让我很有动力去继续做事情，在这一趴我想和大伙聊聊我在技术开源上、内容输出上的一些折腾的事情。\n\n三. 在开源上做了哪些有趣的事？\n\n\n  https://github.com/tw93\n\n\n\n\n开源作品上继续迭代着妙言、Pake 这两个产品，同时新增了个 Maple Chrome 扩展自用，加上 XRender、潮流周刊、博客，23 年一共维护着 6 个产品，其中妙言 Star 3.5k->5K，累计发布 6 个版本，Pake Star 9.8k -> 20.9k，累计发布 12 个版本，加上之前开源的 Weex Ui，我的代码类开源作品累计有 38K Star，4600 Follower。\n\n\n\n今年是我玩开源的第九年，从中学习到了不少东西，认识了不少朋友，也借此自驱的去学习如何做一个好用的产品，如何把开源经验应用到工作、团队管理上。不过今年下半年业余时间大部分在房子软装，周末写开源代码时间少了些，期待 24 年能够多花时间在开源上做些好用的东西给大家使用。\n\n四. 输出了什么哪些有用的内容？\n\n把推特当做小记\n\n\n  https://twitter.com/HiTw93\n\n\n\n\n推特从 22 年的 22k 关注者涨到了 23 年的 74k，每天早上发一条昨天看到的比较不错的工具，或者是折腾的一些好玩的东西，或者是开源产品的更新、最近的文章、感想、学习，甚至还可能是生活中做的菜，我不喜欢网红氛围，不喜欢哗众取宠，不喜欢争论事情，不喜欢随波逐流，推特对我而言更像是一个和志同道合的朋友交流的地方。\n\n把周刊当做朋友圈\n\n\n  https://weekly.tw93.fun/\n\n\n\n\n潮流周刊起源于 20 年团队会上立的一个 Flag，在 23 年一共输出了 52 期，当前累计 163 期，同步发布在内网语雀、外网，将自己一周看到的技术学习、潮流工具、书籍电影给整理出来，更像是一个每周习惯，每期选封面图很像发朋友圈，也正是封面图让我多出去走拍拍好看照片，也吸引了一批感兴趣的小伙伴一起交流，挺好的。\n\n把博客当做花园\n\n\n  https://tw93.fun\n\n\n\n    \n        技术折腾\n        生活感悟\n    \n    \n        \n            \n                我的年度工具折腾之旅\n                2023 我的浏览器折腾之旅\n                改良了下传说中最快的终端\n                新一代前端发展的困境与破局(演讲)\n                Pake - 轻松构建轻量级桌面应用(演讲)\n                我的开源成长之旅(演讲)\n                该以一种怎么样的心态来对待开源\n                译·如何做出伟大的工作\n            \n        \n        \n            \n                日本东京&大阪游记\n                香港和想象中不一样的地方\n                全飞秒近视手术过程和恢复记录\n                我的咖啡机入门实践\n                我的家庭影院入门实践\n                我的自行车入门实践\n                我居然 30 岁了\n                不喜欢前端娱乐圈这种氛围\n            \n        \n    \n\n\n23 年写博客要比之前更加勤快一些，一方面由于对外演讲多了一点，一方面博客慢慢加入了生活的元素，这一年累计写了 16 篇博客，有长有短，有虚有实，把一些值得沉淀的内容都放在了这里，慢慢就变成一个花园，读者进来后可以慢慢看，到处瞧瞧找找，对于感兴趣的内容一起讨论交流，这个过程很有意思。\n\n工作\n\n从毕业到现在工作 8 年了，时间过起来真是快，从最开始的很新的年轻人，慢慢变成了部门的老人，幸运的是每一年做得事情我都很喜欢也很有挑战，通过解决难题来让我有持续的动力，这次想和大家聊聊我这一年在工作上做的一些有挑战的事情。\n\n五. 团队上有什么好的变化？\n\n\n\n人数翻倍：从 22 年 30 人（24 正式 + 6SP）变成了现在 58 人（36 正式 + 22SP），按照工作职能分成了 4 个小组，培养出 2 个一线 TeamLeader 做得很棒，还有 2 个小组长也慢慢做出感觉来了。\n\n角色转变：团队不少同学完成从前端工程师往产品工程师升级，具备很好的产品 Sense，会画原型交互，会用产品化的方式去解决问题，也具备一定的多团队角色协作的能力，都慢慢成长起来了。\n\n氛围变化：持续用开源社区的方式去做团队建设，尽力去推工程师文化，双周有趣技术分享会场场人满无瞌睡，每月的 OneOne 沟通慢慢做起来了，没有所谓上下级的观念，更多关注技术本身，有问题直接指出，加上年轻人慢慢多了起来，氛围变得更加轻松直接。\n\n六. 做了哪些不一样的工作？\n\n把自己当做专业的服务端去做事情：这一年成立了个专职的 Node 后端团队，承接公司业务的对外网关对接以及开放能力，并提供服务接口给行业 Java 后端去调用，借助我们产品工程师的优势，把这一套业务支撑做得事情做成了一个工作台，借助了很多 AI 的能力去提效，最终效率相比之前提升了 2 倍多，省掉了不少人力成本，同时由于产品化做得比较简单易用，可以满足产品、开发、测试在上面协作使用。不过这里也有一个很大的挑战，前端转换成做后端，在稳定性能力、业务全链路能力相比专业后端有一定差距，近半年持续重点在做这方面做提升。\n\n把自己当做独立创业者去做事情：这一年 AI 特别火，将团队想法不错同学拉出来成立了一个 AI 的虚拟小组，我们花了很多时间去做 AI 与业务场景的融合落地，从 Demo 快速实验验证效果到产品化能力批量化流程生产，在业务上有强痛点、需求具备规模性、边际成本低的场景上做了大量的落地，最后变成业务追着我们提需求通过 AI 去解决问题，在 AI 浪潮中慢慢变成了没有岗位区分，而是一个解决各种问题的全栈工程师。\n\n把自己外国人的习惯去做事情：由于疫情的放开，国际化这一块投入加大，也慢慢有意识拆出一块国际的前端团队，在本对本用户、商家使用产品的开发上，我们放弃了之前国内这一套开发模式和交互习惯，在多语言、多时区、多货币场景下，多想当地人的操作习惯，并在技术选型上使用目前社区成熟的方式去做尝试。\n\n把自己当做数据分析师去做事情：数据更多是用于发现问题的，但是很多时候不是没有数据，而是没有一个好的分析方式，这一年我们在业务经营数据产品化、用户流量数据产品化、开放埋点数据校验产品化上、性能体验顺畅度诊断工具上做了挺多事情，慢慢去学习数据分析的一些业务方法思路，并有意识的借助前端的用户使用视角去寻找更好的分析展示方式，帮助业务发现更多看不见的问题。\n\n七. 个人而言有什么成长和遗憾？\n\n成长：由于 22 年带着团队做了不少有挑战的事，帮助业务解决了些难题，在 23 年初时直通晋升到了下个层级，这一年来要求和能力水位相比之前要高不少，好在有很多干活三观上很契合的合作方，在做难搞的事情上给了很多无声的帮助，也学习到了对方很多技术判断上做事情的方法。\n\n遗憾：一方面由于事情比较多，加上频繁需要和大家对技术方案，自己时间分配不太合理，写代码的时间相比之前少了不少，很多时候写代码是让自己放松的一个很好方式；另一方面，由于精力的分配这一年的锻炼除了骑自行车外少之可怜，书也看得不是很多，越往后走越觉得有一个健康的身体加上一个有想法的脑袋比什么都重要，这里有点遗憾。\n\n结尾\n\n写文章前，想了挺久用一个什么词来描述我的 2023，最后选择了「随心而行」，多做自己想做的事情，根据自己的心意或兴趣来行动，不受外界约束或影响，或许这也是是生活的意义。\n\n希望我的 2024，多去做些不一样的事情，在平凡的日子里活得更有意思些，希望你也是。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "我的年度工具折腾之旅",
    "link": "https://tw93.fun/2024-02-09/tools.html",
    "pubDate": "Fri, 09 Feb 2024 00:00:00 -0500",
    "excerpt": "最近趁着过年有空，将一年自己使用的比较不错的 Mac 软件、网站、生活好物给整理了一下，保持着简单易用美观的原则，期待当你有同样选择纠结的时候的一些帮助。\n\nMac 软件\n\n今年没有过多的折腾软件，更多是在持续使用的基础上去做些优化让自己用起来更舒服，尽量不用两种功能类似的软件，保持简单易用美观的原则，这是我今年使用的比较不错的 Mac 软件，假如你也喜欢折腾，可以将一些没有用过的软件下载起来玩玩。\n\n\n\n今年最爱\n\n\n  妙言：一个自己 3 年前开发的简单易用的原生 Markdown 笔记应用，使用过程中持续更新着。\n  ChatGPT 桌面端：通过自己开发的 Pake 打包官方 GPT 网页版本的桌面端，注入了样式和脚本方便更好使用，通过快捷键唤起每天使用。\n  MessAuto：一个接收手机短信验证码并自动回填到 Mac 上的小工具，很好用，解决了每次从手机看然后手填的麻烦。\n  Alacritty：一个用 Rust 写的命令行终端，之前博客有发过 改良了下传说中最快的终端 这篇文章，很快很简单很漂亮。\n  Top Calendar：一个菜单栏的日历软件，可以看到日历、节假日、农历，以及最近的日程，关键也是做得很美观。\n  Shottr：超级喜欢的一个截图软件，平时大家看到我发的推对应截图不少通过他自己截取的，同时也支持滚动截图、标注等功能。\n  Raycast：这个全局搜索工具超级好用和强大，假如你还在用 Alfred，很推荐你试试，此外他的出现，通过插件还可以帮你干掉很多软件。\n  Bob：随手翻译软件，配置了 OpenAI 的服务，划词一键翻译，快捷键唤起翻译，多个翻译对比结果，很是喜欢。\n  uPic：一个超级方便的图片上传软件，可以用 FaaS 写一个上传服务或者直接使用云厂商的 OSS 服务，可以一键上传直接复制使用。\n\n\n输入输出\n\n\n  MindNode：可以画出很好看的脑图的工具，从工作开始用了快 8 年了，用于脑暴快速思考使用。\n  NetNewsWire：RSS 订阅软件，我的大部分资讯和技术文章阅读来源于 RSS，通过这个工具给我推送阅读。\n  Things：很简洁的备忘 Todo 软件，正是由于太简单了，反而能够让你更加聚焦使用。\n  Revezone：最近 Excalidraw 帮了我很多忙，用于产出一些产品的原型便于团队同学快速去落地，Revezone 这个工具支持不错的中文字体以及多 Tab 使用，解决了之前单实例的问题。\n  VSCode：依然是我用得最多的代码编辑器，甚在什么代码都可以打开直接修改，同时美观。\n  WebStorm：项目场景开发使用，之前博客有发过 你居然还在用 WebStorm 文章，特别喜欢他的 git 比对功能，很稳定，没有软件做得他那么好用。\n  Spotify：我的多设备音乐播放软件，之前有推荐过，喜欢他的简单和歌曲丰富音质不错。\n  邮件，没错就是苹果默认的邮件，可以简单设置一下，之前有发过 推，让他的侧边栏隐藏，各个邮箱置顶 Tab 的方式，很方便使用。\n\n\n效率工具\n\n\n  Edge 浏览器：这个浏览器我属于又爱又恨，有试过 Arc 奈何还是有些复杂最多坚持一周，主要用 Edge 的最大原因是垂直标签栏以及性能速度很不错，博客有写过 2023 我的浏览器折腾之旅 可参考。\n  Thorium 浏览器：由于 Edge 还不是很美观，年中的时候发现了一个超级快以及可以自定义不少能力的浏览器，我会时不时切换到这个使用，说不定哪天直接替代了 Edge。\n  ScreenFlow：我的默认录制屏幕和编辑视频的软件，很耐用的一个软件，使用起来简单强大，我一般用它来录制产品演示以及加速视频。\n  TotalFinder：很强大的 Finder 代替工具，让他变成类似 Chrome 多 Tab 这种体验，同时和原有的很像，增加了不少有用的功能比如说剪切。\n  App Cleaner & Uninstaller：软件卸载工具，对于一个常常试用软件的人，这个卸载得很干净的工具很需要，界面漂亮功能好用。\n  Stash：科学上网工具，由于多端使用，特别是 Apple TV / 手机 / 电脑不想来回折腾 ，加上作者持续迭代着，还不错。\n  Dozer：帮你隐藏顶部菜单栏多余的应用图标，对于一个强迫症，只能允许需要的软件出现。\n  Input Source Pro：推友开发的一个输入法自动切换工具，用了好久了，使用起来很默默无闻，但是帮我节省了很多时间。\n  Drop：取色软件，特别是 UI 开发过程中，假如想去配一个好看的颜色，可以借助这个工具看看做得好的软件的颜色是什么。\n  DMG Canvas：用于 Mac 开发中编辑产生 dmg 安装包的工具，做得很简单易于使用。\n\n\n工具网站\n\n这次从 潮流周刊 2023 年近 50 篇文章中选择出一批我常用的学习/视听/工具/素材的网站。\n\n\n\n学习类\n\n\n  Language Reactor：一个很不错的学习英语发音工具，透过观赏外语电影与电视剧，愉快且有效地自学新的语言。\n  YouGlish：使用 YouTube 来提高你的英语发音，告诉你真实人们在什么情境下说英语。\n  元素周期表 PRO：高颜值化学必备工具，很适合喜欢化学的小伙伴，通过可视化的方式来展示元素周期表。\n  Dribbble：一般通过这个来看一些不错的设计师作品，提高自己的审美。\n  美叶：设计内容推荐平台，相比 Dribbble，本土化做得更好，设计相关的素材学习特别丰富。\n  Supercreative：一千个灵感网站收集，当你没有好的想法的时候，可以去看看。\n  MuscleWiki：肌肉锻炼网站，可以很清楚看到你想锻炼的地方应该怎样来练习。\n  every-programmer-should-know：将每个软件开发人员都应该知道的技术事项的集合进行了整理，包括计算机科学、算法数据结构、分布式、正则、安全、可用性、代码设计、工程哲学等，适合喜欢钻研的同学。\n\n\n视听类\n\n\n  SkylineWebcams：一个全球高清摄像头实时分享，通过他你可以看到耶路撒冷的西墙、埃特纳的火山爆发、南非头水坑的大象，甚至苏梅岛夜店门口的路景。\n  EarthCam：可以看到世界各地的城市风景、建筑、甚至动物园、海洋馆里面的实时直播，甚至还可以看到有人分享的鸡蛋孵化小鸡的过程。\n  City Walks：一个在各个城市散步的网站，实时观看来自全球各地的城市街景，了解当地氛围景色要好不少。\n  NASA Eyes：一个很牛逼的三维太空可视化探索工具，可以实时体会到从太空可地球、行星、卫星运行状态、位置，对于星文爱好者甚至可以用这个来探索下太阳系和宇宙中好玩的东西。\n  Radio Garden：通过全球地球 3D 可视化的方式浏览不同国家城市的高质量广播，甚至还可以发现众多各种风格的小众国外音乐。\n  Music For Programming：一个很适合编程时听的音乐 MusicForProgramming 工具，作者精挑细选了不少音乐有助于让减少分心，帮助你更加专注，有一点点心流的魔法。\n\n\n工具类\n\n\n  Shots：我很喜欢的一个截图生成的工具，可以生成漂亮的各种格式风格的截图背景。\n  Upscayl：AI 图片放大工具，也提供客户端的能力，超级方便好用。\n  AllinOneTools：使用一个工具完成各种文件格式的转换，包括图片、PDF、视频、网页等。\n  IT Tools：一个很全的给开发人员提供方便的在线工具的网站，好比工程师的瑞士军刀。\n  WakaTime：支持各种代码 IDE 的时间/类型/项目的指标监控度量工具，可以看你敲了多少代码。\n  OrbStack：一个超级漂亮轻量的用于替代 Docker、Linux 的 Mac 工具。\n  Bio Link：一个简单的个人链接网站，可以将自己作品地址放到上面，用于汇总展示。\n  Reactive Resume：一个免费开源的简历编辑工具，适合要找工作的人使用。\n  Nomad List：收集和展示了数千个城市的数字游民指数，包括成本、网络速度、生活质量等，你可以探索到一个最适合工作和生活的地方。\n\n\n素材类\n\n\n  macOSicons：超过 5000 个适用于 macOS 和 iOS 的免费图标，常用于替换 Mac 上面软件不好看的图标保证统一风格。\n  Pexels：免费的图片和视频素材的网站。\n  Loose Drawing：可商用的插画素材，一个日本设计师弄的，里面的风格挺不错的。\n  ManyPixels：矢量图插图下载网站，一些深色背景的也比较合适使用，每一张图都做得很细腻精致。\n  Mockups Design：一个免费的高质量真实世界的模版素材下载的网站，比如手 3D 物体、画册、名片等素材样张 PSD 文件。\n\n\n生活好物\n\n工程师其实除了软件代码外，更需要有生活和爱生活，赚钱的意义最终是为了更幸福的生活，这里给大伙推荐下我使用下来觉得可以提高幸福感的生活物件，假如你有选择困难症，或者刚好在装修，说不定可以参考一下。\n\n\n\nIT 设备\n\n\n  电脑：MacBook Pro M2 32GB 16 寸深空灰，相比之前 19 款要快太多了，我由于不用显示器，所以电脑尽可能选屏幕大的。\n  手机：iPhone 15 Pro 256GB 原色，相比之前的 13Pro 外观质感要好不少，很轻，对于常用的设备很建议在力所能力下买更好的。\n  耳机：AirPods Pro2，之前 Pro1 用了 3 年左右，之后把其他耳机都给咸鱼了，现在只有这个耳机，完全满足日常各种场景使用。\n  手表：Apple Watch Series 7 星光色，买了几年了，属于美丽小废物，换了官方尼龙回环表带佩戴无感，假如只当做手表那么不值，当做装饰和健康监控，那还可以。\n  路由器：小米 AX9000，一个大黑块头，性能和网速很强劲，覆盖全屋，加上宽带很便宜，在家里体会看网飞 4K 视频快进拖动很顺畅。\n  椅子：永艺人体工学椅 MC-1128E 灰白色，椅背可升降，腰靠可角度调节，隐藏式拉脚踏，可倾仰，山姆买的，很舒服性价比很高。\n  台灯：米家台灯 1S 增强版耀夜黑，之前推特有发过，做得实在太太精致好看了，我平时用电脑和看书的时候会打开，灯光不错。\n  充电宝：安克自带线 10000 毫安 30W，出门旅游前买的，现在发现很好用很美观，甚至有时候在客厅不想用插线，包括给家里其他设备充电直接插上就好，很方便。\n\n\n家庭影院\n\n\n\n\n  盒子：Apple TV 7，之前有在推特和博客都推荐过 我的家庭影院入门实践：Apple TV 我愿称之为年度最值的产品，太太太简单好用了。\n  电视：索尼 X90L 75 寸，当时买电视的时候去线下对比了不少，在性价比考虑范围内选择这款，用下来体验的确电视只有索尼和其他，不过假如你有钱，建议买越大越好。\n  音响：三星 Q600B 回音壁 + 后环绕 9200S，价格比较实惠，效果相比直接电视发声好太多了，买了回音壁很建议加上后环绕。\n\n\n小家电\n\n\n  咖啡机：德龙 ECP33.21.W 半自动咖啡机，咖啡机属于我生活中最最最幸福感的一个机器了，之前推特有推荐过配套设施，太喜欢了。\n  空气炸锅：松下 NF-HCSAM400，逛山姆时候买的，299，后面经常用来烤面包烤鸡翅，很不错的，同时白色的颜值很高。\n  电饭煲：东芝 1H RC-10HPC，想着吃上香喷喷的米饭，就买了一个稍贵的电饭煲，这里家里过来一致觉得煮饭好吃。\n\n\n大东西\n\n\n  玩具车：特斯拉 Model3 红色，远远看就像一个小时候喜欢的玩具车，很喜欢简单美感的产品，买了 2 年多了，生活半径大了很多，优点远大于缺点。\n  自行车：大行 P8 消光黑折叠车，这个车太太太喜欢了，线下购买，很好骑，之前有写过 我的自行车入门实践 可参考。\n  洗衣机：LG 洗烘套装 FY11MW4 + RH10V9PV2W，买洗衣机也做了很多功课，很多网上图片吹得花里胡哨，线下一看其实质感很一般，看来看去 LG 性价比美观上都不错，最后使用下来体验很好，洗完衣服直接烘干就收起来了。\n  冰箱：松下 NR-W591-CP-W 十字对开门白冰箱，好看的要么太贵，买么尺寸不合适，这款价格、尺寸、功能、美观刚刚好，关于选冰箱小红书上有很多最佳实践，可以线下看看，不过第一选择应该是尺寸是否 OK。\n  床垫：Serta 舒达肖恩床垫，买床垫属于所有东西里面最费力气的事情，因为品牌很多，而且很多需要实际睡过才知道感觉，很多我感觉不值那个价，第一考虑舒适度，想起五星级酒店床垫不错，查了查希尔顿、万豪这种用的舒达家的，最后线下买了，包裹感很强基本上每天很快入睡，翻身也没啥动静。\n  净水器：史密斯佳尼特 CAR800-FA1，家里相当于不需要再买桶装水了，支持热水、温水、冷水直饮，这款性价比 OK，其他的都很好，不过有时间假如我需要接很多开水的时候就需要分几次，还好这种场景不是很多。\n\n\n智能工具\n\n\n  门铃：小米智能门铃 3，这个不到 300 的小东西，我愿称为最该买的一个东西，充一次电可以用半年，充当门外摄像头和门铃两大功能，安装在门锁上方，和原有的锁很搭配，完全不突兀。\n  洗手机：苏泊尔自动感应泡沫洗手机，这个小东西放洗手间超级实用，灌入洗手液，充一次电可以用半年，手放到瓶身，自动出泡沫。\n  电动牙刷：Usmile Y10 曜黑，价格合适，充一次电用半年，带一个小屏幕现实电量、模式，居然还支持检测你没有没有刷到位，相比之前买的其他品牌新价比高很多。\n  音箱：小爱音箱 Pro 小黑桶，用过其他的音箱发现都不那么聪明，结果小爱还好，能用，也不多嘴，用来中枢控制家里的设备还不错。\n  窗帘：米家智能窗帘 1S ，卧室自动窗帘是我认为最有用的智能设备了，早上开，晚上关，一句话就好了，为啥选小米，还是由于不太熟悉这个领域，就选了性价比高的。\n  扫地机器人：石头 p10 pro，使用起来还不错，就是声音有些大，或许大部分扫地机声音都大，当时做了点功课选择了这个，买后几乎没有拖过地，选择外出后自动扫拖，解放了不少。\n  阳台灯：美的雷达光感人体感应吸顶灯，把之前的灯给换了，现在只需要满足黑夜以及外面有人走动就自动开和关，还是比较方便。\n  温湿度计：米家温湿度计 3，属于美观的装饰品，默默无闻，但是很多时候看看家里的温度、湿度还是很不错的。\n\n\n\n\n最后，生活需要一些有趣的东西，保持折腾，保持喜爱，保持年轻，保持热爱，同样也祝你幸福。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "我的开源成长之旅",
    "link": "https://tw93.fun/2024-01-12/open.html",
    "pubDate": "Fri, 12 Jan 2024 00:00:00 -0500",
    "excerpt": "在微软上海 Github Universe 2023 的一个分享，主要是讲我从大学开源到现在 9 年做的一些有趣的事情，以及如何做好一个开源产品的经验，希望可以给热爱开源的朋友一些输入，现场分享视频在文章后面，感兴趣的小伙伴可以一看。\n\n\n  我的 Github：https://github.com/tw93\n\n\n分享稿\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n现场视频\n\n\n\n\n\n\n现场照片",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "我居然 30 岁了",
    "link": "https://tw93.fun/2023-12-30/30.html",
    "pubDate": "Sat, 30 Dec 2023 00:00:00 -0500",
    "excerpt": "过完今晚我居然就满 30 岁了，一直很无耻的感觉自己才 24 岁，虽然在这之前，我更无耻的认为自己才 18 岁，真不敢想象时间怎么过得这么快，年纪好像是一个从山顶滚下来的轮子，随着时间拉长越滚越快。虽然经历越来越丰富，但一年的时间长度感知明显比小时候得短很多，还是会有些惋惜和遗憾。\n\n发现身边不少人随着时间的变化，慢慢的就有那个年纪该有的样子，好比到了要转变的时候，会自动升级一样，比如说从学生踏入社会里面就变成了一个成人，从年轻人到有小孩以后就立马变成了成熟父亲角色。我感觉我在角色变化上一直是被外力推着走的，甚至有些别扭，有一种心态还是大学阶段的没啥变化的感觉，很像送快递作者胡安焉在文章中说的那个感觉。不过这种稚嫩心态我反而没有阻碍到我，反而还让我活得更轻松好奇一些，可能是当时大学稀里糊涂喜欢上了敲代码，在 15 年毕业时走狗屎运找到了喜欢的程序员工作，不需要过于考虑社会人情世故，要是没学计算机去做了其他的行业，可能会很难适应现在这个社会。\n\n应该是在工作 2 年后，等到 95 后入职，逐步发现自己不是团队中年纪最小的了，然后慢慢发现 97 的在团队里成为中坚力量，到现在 00 后开始来实习了，不由的感叹，年轻真好啊，年轻人真不错啊，优秀的年轻人很多地方很值得学习，会更有意识的去培养有潜力年轻人，给到更多空间挑战，不喜欢按资排辈的去安排事情，而是觉得能力牛逼和年纪无关。\n\n回到现在 30 岁，希望能一直保持住 too young too simple，希望到 40 岁、50 岁、甚至 60 岁的时候心态还是年轻的那种感觉，依旧潮流，依旧写自己喜欢的代码。不跟风，不攀比，不要变得油腻，不要变得年轻时候讨厌的那种中年人好为人师的样子，让自己舒舒服服过日子就够了。",
    "tags": [],
    "author": "unknown-author",
    "source": "Tw93 Blog"
  },
  {
    "title": "Φωτογραφίες και βίντεο της τάξης μας - Δ' τάξη 2022/23",
    "link": "https://liagason.com/4th-grade-media",
    "pubDate": "Tue, 13 Jun 2023 00:00:00 +0300",
    "excerpt": "Φωτογραφίες και βίντεο της τάξης μας\nΠαιδάκια, να έχετε ένα όμορφο καλοκαίρι, να ξεκουραστείτε και να παίξετε πολύ!\nΠαρακάτω είναι οι φωτογραφίες από τη χρονιά που πέρασε κι ένα βίντεο που έφτιαξα για την τάξη μας!\n👉Κάντε κλικ εδώ!👈\n\n(Το βράδυ θα προσθέσω φωτογραφίες και βίντεο από τη γιορτή. Καλό καλοκαίρι!)",
    "tags": [],
    "author": "unknown-author",
    "source": "Sotiris Liagkas"
  },
  {
    "title": "Παιχνίδια με τα Επιρρήματα - Scratch",
    "link": "https://liagason.com/scratch-games-greek-adverbs",
    "pubDate": "Fri, 05 May 2023 00:00:00 +0300",
    "excerpt": "Δύο παιχνίδια με Επιρρήματα για τη Δ’ τάξη\nΠαιχνίδια στο Scratch για χρονικά, τοπικά και τροπικά επιρρήματα για τις μικρές τάξεις του Δημοτικού:\nΠαιχνίδι περιπέτειας\nΠαιχνίδι με λαβύρινθο\n\nΓια να μπορέσετε να κάνετε αλλαγές πατήστε το κουμπί ‘Δείτε μέσα’, είναι δεξιά στο πάνω μέρος της οθόνης.",
    "tags": [],
    "author": "unknown-author",
    "source": "Sotiris Liagkas"
  },
  {
    "title": "Παιχνίδια στο Scratch - Δ' τάξη  🐱🧑‍💻",
    "link": "https://liagason.com/scratch-programming-4th-grade",
    "pubDate": "Fri, 28 Apr 2023 00:00:00 +0300",
    "excerpt": "Τα παιχνίδια της τάξης μας στο Scratch\nΓεια σας, παιδιά!\nΑνεβάζω εδώ τα παιχνίδια που φτιάξατε με τους λαβύρινθους, έτσι ώστε να τα συνεχίσετε σπίτι αν θέλετε:\nΠαιχνίδι Ομάδας 1 (Ερίσα…)\nΠαιχνίδι Ομάδας 2 (Ρόμι…)\nΠαιχνίδι Ομάδας 3 (Άρτεμις…)\nΠαιχνίδι Ομάδας 4 (Δανιήλ…)\n\nΓια να μπορέσετε να κάνετε αλλαγές πατήστε το κουμπί ‘Δείτε μέσα’, είναι δεξιά στο πάνω μέρος της οθόνης.",
    "tags": [],
    "author": "unknown-author",
    "source": "Sotiris Liagkas"
  }
]