[
  {
    "title": "Nutrical",
    "link": "https://yongfu.name/2024/05/25/nutrical/",
    "pubDate": "Sat, 25 May 2024 00:00:00 +0000",
    "excerpt": "Load nutrical for nutrition calculation.\n1from nutrical import Ingredient, Recipe 2from nutrical.utils import UREG Imei whole wheat toast 1toast = Ingredient(\"Imei Toast\", 2 amount = '300g', 3 calories = 3 * 264, 4 protein = 3 * 11.4, 5 fiber = 3 * 8.1 6) 7toast = toast * (2/7) + 0 * toast 8toast servings amount calories fiber protein ---------- ---------- ---------- ------- --------- 1 85.71 gram 226.29 6.94 9.77 Home-made Yogurt Protein: 6g / 100g 1powder = Ingredient(\"powered milk\", amount='32g', protein=7.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Some Reflections on the Subjective Nature of Psychological Measurements",
    "link": "https://yongfu.name/2023/12/01/reflections-on-subjectivity/",
    "pubDate": "Fri, 01 Dec 2023 00:00:00 +0000",
    "excerpt": "Last month I finally decided to address my left shoulder problem, which has bothered me for probably a decade or two (I can’t recall when it started and it feels as if it has always been there). The problem is that I find it quite effortful to externally rotate my left arm. It feels like I was born with some abnormal bone structure that prohibits me from properly rotating my arm, at least this is what I considered highly probable before seeing the PT (physical therapist).",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Pick and Stick to a Convention",
    "link": "https://yongfu.name/2023/11/20/writing-conventions/",
    "pubDate": "Mon, 20 Nov 2023 00:00:00 +0000",
    "excerpt": "Over the years, I have gradually moved from R Markdown to Pandoc’s Markdown when writing documents that require fancy features such as citations and cross-references. R Markdown (and Quarto) is great, especially when the written piece involves a lot of code, but I often found it more efficient to split between the tasks of programming and writing (e.g., plotting with external scripts and then referencing the charts in the document). Furthermore, Pandoc’s functionality is sufficient for my needs. In fact, I sometimes find Pandoc too powerful—once in a while, I come across some Pandoc options providing solutions to things I have dealt with some hacky javascript.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Navigating Taiwan's Public Transport",
    "link": "https://yongfu.name/2023/11/13/taiwan-public-transport/",
    "pubDate": "Mon, 13 Nov 2023 00:00:00 +0000",
    "excerpt": "I recently found myself in a situation similar to many international backpackers in Taiwan. First, I usually travel to small towns or rural areas. Second, I do not have a driver’s license for scooters or motorbikes—public transport is all I can depend on when traveling.\nIn cities other than Taipei (台北), Taichung (台中), and Kaohsiung (高雄) in Taiwan, public transport is limited to railway (台鐵) and buses (公車). In more rural areas, one is only left with buses. Buses arrive infrequently in these areas, and it is quite often to have only 2 or 3 arrivals per day at a particular stop.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "A Diary of Charts",
    "link": "https://yongfu.name/2023/10/27/base-plot/",
    "pubDate": "Fri, 27 Oct 2023 00:00:00 +0000",
    "excerpt": "My love for the base R plotting system has been growing since I started dealing with complicated charts. Complexity in these charts can arise for many reasons. For one, it might simply result from the data structure when working with complex statistical models (e.g., multilevel models). Conventions in the workplace could be another source of complexity. For instance, tweaking a chart in R to replicate the one originally created in Excel could be extremely difficult, and it is nearly impossible to do so with higher-level plotting packages such as ggplot2.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Beyond Item Response Theory",
    "link": "https://yongfu.name/2023/06/27/irt5/",
    "pubDate": "Tue, 27 Jun 2023 00:00:00 +0000",
    "excerpt": "My previous four posts have focused on basic item response models1. These models are commonly found in an educational testing context but are less often seen in clinical research settings where questionnaires are used for the measuring and assessment of individuals’ conditions. Due to the higher level of complexity in the study design of clinical studies, IRT models are often discarded for the analyses of questionnaires. Simple sum scores of the questionnaires, instead of the more robust estimates derived from IRT models, are taken directly to represent the quantity of the latent constructs.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Demystifying Item Response Theory (4/4)",
    "link": "https://yongfu.name/2023/04/26/irt4/",
    "pubDate": "Wed, 26 Apr 2023 00:00:00 +0000",
    "excerpt": "Rating scales require special treatments during data analyses. It is dangerous to treat the choices in a rating scale as simple numerical values. Nor is it satisfactory to treat them as discrete categories in which the internal ordering is thrown away. A rating scale is ordinal in nature, meaning that there is an inherent order among the choices within. This ordering is different from the ordering in numerical values such as counts and heights. In such cases, the differences between numerical values are directly comparable.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Demystifying Item Response Theory (3/4)",
    "link": "https://yongfu.name/2023/03/29/irt3/",
    "pubDate": "Wed, 29 Mar 2023 00:00:00 +0000",
    "excerpt": "Fixed, Random and Mixed Statistics is confusing enough through its massive terminology. Psychology, which is largely experiment-oriented, further confuses people by adding in its own flavor. A peek at the definitions of fixed, random, and mixed effects in the APA Dictionary of Psychology exemplifies this:\n[A mixed-effect model is] any statistical procedure or experimental design that uses one or more independent variables whose levels are specifically selected by the researcher (fixed effects; e.g., gender) and one or more additional independent variables whose levels are chosen randomly from a wide range of possible values (random effects; e.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Demystifying Item Response Theory (2/4)",
    "link": "https://yongfu.name/2023/03/06/irt2/",
    "pubDate": "Mon, 06 Mar 2023 00:00:00 +0000",
    "excerpt": "In Part 1, we went through the simplest item response model, the 1PL model, from the perspective of simulations. Starting with item difficulty and testee ability, we worked forward to simulate item responses that mimic real-world data. Back then, we were precisely laying out the data generating process that is assumed by the item response theory. In this post, we work backward. We will start with the item responses and work back toward the unobserved difficulties and abilities, with the help of statistical models.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  },
  {
    "title": "Demystifying Item Response Theory (1/4)",
    "link": "https://yongfu.name/2023/02/25/irt1/",
    "pubDate": "Sat, 25 Feb 2023 00:00:00 +0000",
    "excerpt": "Okay, so these are the item characteristic curves. What then? Mysterious Item Response Theory Item response theory is mysterious and intimidating to students. It is mysterious in the way it is presented in textbooks, at least in introductory ones. The text often starts with an ambitious conceptual introduction to IRT, which most students would be able to follow, but with some confusion. Curious students might bear with the confusion and expect it to resolve in the following text, only to find themselves disappointed.",
    "tags": [],
    "author": "unknown-author",
    "source": "Yongfu's Blog"
  }
]